---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalElementSelector.Whole
enum: Autodesk.Revit.DB.Structure.AnalyticalElementSelector
source: html/b8d93e4d-3543-637d-5a9d-affa1bced099.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElementSelector.Whole

Entire element